---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtypeType
source: html/049c78eb-54a9-2c22-9e37-87dbb4a2e865.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportPredefinedtypeType Property

"Type IFC Predefined Type"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportPredefinedtypeType { get; }
```